Table of Contents
 Class CustomConversion
Namespace
IdeaStatiCa.PluginsTools.CrossSectionConversions
Assembly
IdeaStatiCa.Plugin.dll
public class CustomConversion : Conversion
Inheritance
object
Conversion
CustomConversion
Inherited Members
 Conversion.MatchRegex
 Conversion.IsMatch(string)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 CustomConversion(string, Func<string, Regex, string>)
public CustomConversion(string pattern, Func<string, Regex, string> func)
Parameters
pattern string
func Func<string, Regex, string>
Methods
 Convert(string)
public override string Convert(string text)
Parameters
text string
Returns
string
 Edit this page